# ElectricalPower Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..ElectricalPower Property
SpecTypeId Class See Also
---
Power, in discipline Electrical.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId ElectricalPower { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElectricalPower As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ElectricalPower {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace